#输出所有的水仙花数，例：1^3 + 5^3+ 3^3 = 153
#水仙花数是指一个 3 位数，它的每个位上的数字的 3次幂之和等于它本身

for num in range(100,1000):
    #先分别取一个数的个十百位
    g = num%10 #个位
    s = (num//10)%10 #十位
    b = num//100 #百位
    sum = g**3 + s**3 + b**3

    if(sum == num):
        print(num,"是水仙花数！")
    else:
        pass#空语句，可以什么都不做 

print("-----------九九乘法表-------------")
for i in range(1,10):
    for j in range(1,i+1):
        #print(i,"*",j,"=",i*j,end=' ')
        print("%d*%d=%-2d"%(i,j,i*j),end=' ')
    print()

print("--------------鸡兔同笼------------------")
for i in range(51): #i表示鸡的数目
    for j in range(26): #j表示兔子的数目
        if(i*2 + j*4 == 100): #每只鸡有两只腿，每只兔子有4只腿，总共有100只腿
            print("鸡的个数为：",i,"兔的个数为：",j)
    